app/Controllers/PemesananMobil.php

INSERT INTO `pemesanan_mobil` (`id_pemesanan`, `id_mobil`, `id_customer`, `id_sopir`, `tanggal_mulai`, `tanggal_selesai`, `total_harga`, `status_pemesanan`) VALUES ('2', '2', '2', '2', '2024-10-18', '2024-10-31', '10000021212', 'gagal')
---
    public function create()
    {
        $input_data = $this->request->getJSON(true);
        if ($input_data) {
            $data = [
                'id_pemesanan'      => $input_data['id_pemesanan'] ?? '',
                'id_mobil'          => $input_data['id_mobil'] ?? '',
                'id_customer'       => $input_data['id_customer'] ?? '',
                'id_sopir'          => $input_data['id_sopir'] ?? '',
                'tanggal_mulai'     => $input_data['tanggal_mulai'] ?? '',
                'tanggal_selesai'   => $input_data['tanggal_selesai'] ?? '',
                'total_harga'       => $input_data['total_harga'] ?? '',
                'status_pemesanan'  => $input_data['status_pemesanan'] ?? ''
            ];

            if ($this->pemesananMobilModel->insert($data)) {

UPDATE `pemesanan_mobil` SET `id_pemesanan` = '2', `id_mobil` = '', `id_customer` = '', `id_sopir` = '', `tanggal_mulai` = '', `tanggal_selesai` = '2024-10-31', `total_harga` = '10000021212', `status_pemesanan` = 'selesai'
WHERE `pemesanan_mobil`.`id_pemesanan` IN ('2')
---
    public function update($id = null)
    {
        $input_data = $this->request->getJSON(true);

        if ($input_data) {
            $data = [
                'id_pemesanan'      => $input_data['id_pemesanan'] ?? '',
                'id_mobil'          => $input_data['id_mobil'] ?? '',
                'id_customer'       => $input_data['id_customer'] ?? '',
                'id_sopir'          => $input_data['id_sopir'] ?? '',
                'tanggal_mulai'     => $input_data['tanggal_mulai'] ?? '',
                'tanggal_selesai'   => $input_data['tanggal_selesai'] ?? '',
                'total_harga'       => $input_data['total_harga'] ?? '',
                'status_pemesanan'  => $input_data['status_pemesanan'] ?? ''
            ];

            if ($this->pemesananMobilModel->update($id, $data)) {