app/Models/PemesananMobilModel.php

SELECT *
FROM `pemesanan_mobil`
---
    public function getPemesananMobil()
    {
        return $this->findAll();